package com.study._06内部类的概述;

/**
 * @Classname: InnerClass
 * @Date: 2024/5/22 21:15
 * @Author: 聂建强
 * @Description:
 *     目标：内部类的概述和分类。
 *
 *     内部类是类的五大成分之一：成员变量，方法，构造器，代码块，内部类。
 *
 *     什么是内部类？
 *         定义在一个类里面的类就是内部类。
 *
 *     内部类有什么用？
 *         可以提供更好的封装性, 内部类有更多权限修饰符 , 封装性有更多的控制。
 *         可以体现出组件的思想。
 *
 *     内部类的分类:
 *         （1）静态内部类。
 *         （2）实例内部类。（成员内部类）
 *         （3）局部内部类。
 *         （4）匿名内部类。（重点）
 *
 *     小结：
 *         匿名内部类是我们的重点。
 *
 */
public class InnerClass {

}

// 外部类只能用public或者缺省修饰的，不能用private和protected 修饰
// 内部类，可以使用更多的修饰符